BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega32HVBrevB.PIC
        <edc:SFRDef edc:_addr="0xBE" edc:access="nn---nnn" edc:cname="TWBCSR" edc:nzwidth="0x8" ltx:memberofperipheral="TWI">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TWBCIP" edc:desc="TWI Bus Connect/Disconnect Interrupt Polarity" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWBDT" edc:desc="TWI Bus Disconnect Time-out Period" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="250ms" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="500ms" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="1000ms" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="2000ms" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="TWBCIE" edc:desc="TWI Bus Connect/Disconnect Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWBCIF" edc:desc="TWI Bus Connect/Disconnect Interrupt Flag" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xBF" edc:offset="0x9"/>
        <edc:SFRDef edc:_addr="0xC8" edc:access="n--n--nn" edc:cname="ROCR" edc:nzwidth="0x8" ltx:memberofperipheral="VOLTAGE_REGULATOR">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ROCWIE" edc:desc="ROC Warning Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ROCWIF" edc:desc="ROC Warning Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="ROCD" edc:desc="ROC Disable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="ROCS" edc:desc="ROC Status" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xC9" edc:offset="0x7"/>
        <edc:SFRDef edc:_addr="0xD0" edc:access="--nnnnnn" edc:cname="BGCCR" edc:nzwidth="0x8" ltx:memberofperipheral="BANDGAP">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BGCC" edc:desc="BG Calibration of PTAT Current Bits" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xD1" edc:access="nnnnnnnn" edc:cname="BGCRR" edc:nzwidth="0x8" ltx:memberofperipheral="BANDGAP"/>
        <edc:SFRDef edc:_addr="0xD2" edc:access="--nn--nn" edc:cname="BGCSR" edc:nzwidth="0x8" ltx:memberofperipheral="BANDGAP">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BGSCDIE" edc:desc="Bandgap Short Circuit Detection Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BGSCDIF" edc:desc="Bandgap Short Circuit Detection Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="BGSCDE" edc:desc="Bandgap Short Circuit Detection Enabled" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BGD" edc:desc="Bandgap Disable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xD3" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0xD4" edc:access="---nnnnn" edc:cname="CHGDCSR" edc:nzwidth="0x8" ltx:memberofperipheral="CHARGER_DETECT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CHGDIE" edc:desc="Charger Detect Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CHGDIF" edc:desc="Charger Detect Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CHGDISC" edc:desc="Charger Detect Interrupt Sense Control" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="BATTPVL" edc:desc="BATT Pin Voltage Level" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xD5" edc:offset="0xB"/>
        <edc:SFRDef edc:_addr="0xE0" edc:access="nnnnnnnn" edc:cname="CADAC0" edc:nzwidth="0x8" ltx:memberofperipheral="COULOMB_COUNTER"/>
        <edc:SFRDef edc:_addr="0xE1" edc:access="nnnnnnnn" edc:cname="CADAC1" edc:nzwidth="0x8" ltx:memberofperipheral="COULOMB_COUNTER"/>
        <edc:SFRDef edc:_addr="0xE2" edc:access="nnnnnnnn" edc:cname="CADAC2" edc:nzwidth="0x8" ltx:memberofperipheral="COULOMB_COUNTER"/>
        <edc:SFRDef edc:_addr="0xE3" edc:access="nnnnnnnn" edc:cname="CADAC3" edc:nzwidth="0x8" ltx:memberofperipheral="COULOMB_COUNTER"/>
        <edc:SFRDef edc:_addr="0xE4" edc:access="nnnnnnnnnnnnnnnn" edc:cname="CADIC" edc:nzwidth="0x10" ltx:memberofperipheral="COULOMB_COUNTER"/>
        <edc:SFRDef edc:_addr="0xE6" edc:access="nnnnnnnn" edc:cname="CADCSRA" edc:nzwidth="0x8" ltx:memberofperipheral="COULOMB_COUNTER">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CADSE" edc:desc="When the CADSE bit is written to one, the ongoing CC-ADC conversion is aborted, and the CC-ADC enters Regular Current detection mode." edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CADSI" edc:desc="The CADSI bits determine the current sampling interval for the Regular Current detection in Power-down mode. The actual settings remain to be determined." edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="CADAS" edc:desc="CC_ADC Accumulate Current Select Bits" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="CADUB" edc:desc="CC_ADC Update Busy" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CADPOL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CADEN" edc:desc="When the CADEN bit is cleared (zero), the CC-ADC is disabled. When the CADEN bit is set (one), the CC-ADC will continuously measure the voltage drop over the external sense resistor RSENSE. In Power-down, only the Regular Current detection is active. In Power-off, the CC-ADC is always disabled." edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE7" edc:access="-nnn-nnn" edc:cname="CADCSRB" edc:nzwidth="0x8" ltx:memberofperipheral="COULOMB_COUNTER">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CADICIF" edc:desc="CC-ADC Instantaneous Current Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CADRCIF" edc:desc="CC-ADC Accumulate Current Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CADACIF" edc:desc="CC-ADC Accumulate Current Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="CADICIE" edc:desc="CAD Instantenous Current Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CADRCIE" edc:desc="Regular Current Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CADACIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE8" edc:access="-------n" edc:cname="CADCSRC" edc:nzwidth="0x8" ltx:memberofperipheral="COULOMB_COUNTER">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CADVSE" edc:desc="CC-ADC Voltage Scaling Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
